In [1]:
import numpy as np

In [2]:
import pandas as pd

In [9]:
sözlükverisi={"Istanbul":[30,29,np.nan],"Ankara": [20,np.nan,25],"İzmir": [42,39,38]}
havaDurumuDataFrame=pd.DataFrame(sözlükverisi)

In [10]:
havaDurumuDataFrame

   Istanbul  Ankara  İzmir
0      30.0    20.0     42
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  İzmir
0      30.0    20.0     42

In [12]:
havaDurumuDataFrame.dropna(axis=1)

   İzmir
0     42
1     39
2     38

In [13]:
yeniveri={"Istanbul":[30,29,np.nan],"Ankara": [20,np.nan,25],"İzmir": [42,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniveri)

In [14]:
yeniDataFrame

   Istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     42     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [16]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  İzmir
0      30.0    20.0     42
1      29.0     NaN     39
2       NaN    25.0     38

In [17]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     42     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [18]:
##groupby

In [22]:
maasSozlugu={"Departman":["Yazılım","Yazılım" ,"Finans","Finans","Hukuk","Hukuk"],
            "Çalisan Ismi":["Ahmet","Mehmet","Atıl","Burak","Zeynep","Fatma"],
            "Maas":[100,150,200,300,400,500]
            }

In [23]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [24]:
maasDataFrame

  Departman Çalisan Ismi  Maas
0   Yazılım        Ahmet   100
1   Yazılım       Mehmet   150
2    Finans         Atıl   200
3    Finans        Burak   300
4     Hukuk       Zeynep   400
5     Hukuk        Fatma   500

In [26]:
grupobjesi=maasDataFrame.groupby("Departman")

In [27]:
grupobjesi.count()

           Çalisan Ismi  Maas
Departman
Finans                2     2
Hukuk                 2     2
Yazılım               2     2

In [28]:
grupobjesi.mean()

            Maas
Departman
Finans     250.0
Hukuk      450.0
Yazılım    125.0

In [30]:
grupobjesi.min()

          Çalisan Ismi  Maas
Departman
Finans            Atıl   200
Hukuk            Fatma   400
Yazılım          Ahmet   100

In [31]:
grupobjesi.max()

          Çalisan Ismi  Maas
Departman
Finans           Burak   300
Hukuk           Zeynep   500
Yazılım         Mehmet   150

In [32]:
grupobjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Finans      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0